import pandas as pd
import numpy as np

#5基于用户订单资料与用户APP行为的整合分析处理

F2 = pd.read_csv('workeddata/F2.csv')
F3 = pd.read_csv('workeddata/F3.csv')
F23 = F2.join(F3.set_index('ID'), on='ID')

# F2.3.1 所有动作_订单_占比
# F2.3.2 非支付动作_订单_占比
# F2.3.3 支付动作_订单_占比
# F2.3.4 动作1_订单_占比
# F2.3.5 动作2_订单_占比
# F2.3.6 动作3_订单_占比
# F2.3.7 动作4_订单_占比
# F2.3.8 动作5_订单_占比
# F2.3.9 动作6_订单_占比
# F2.3.10 动作7_订单_占比
# F2.3.11 动作8_订单_占比
# F2.3.12 动作9_订单_占比
# F2.3.13 所有动作_精品订单_占比
# F2.3.14 非支付动作_精品订单_占比
# F2.3.15 支付动作_精品订单_占比
# F2.3.16 动作1_精品订单_占比
# F2.3.17 动作2_精品订单_占比
# F2.3.18 动作3_精品订单_占比
# F2.3.19 动作4_精品订单_占比
# F2.3.20 动作5_精品订单_占比
# F2.3.21 动作6_精品订单_占比
# F2.3.22 动作7_精品订单_占比
# F2.3.23 动作8_精品订单_占比
# F2.3.24 动作9_精品订单_占比
F23['F2.3.1'] = F23['F3.1'] / F23['F2.1']
F23['F2.3.2'] = F23['F3.2'] / F23['F2.1']
F23['F2.3.3'] = F23['F3.3'] / F23['F2.1']
F23['F2.3.4'] = F23['F3.4'] / F23['F2.1']
F23['F2.3.5'] = F23['F3.5'] / F23['F2.1']
F23['F2.3.6'] = F23['F3.6'] / F23['F2.1']
F23['F2.3.7'] = F23['F3.7'] / F23['F2.1']
F23['F2.3.8'] = F23['F3.8'] / F23['F2.1']
F23['F2.3.9'] = F23['F3.9'] / F23['F2.1']
F23['F2.3.10'] = F23['F3.10'] / F23['F2.1']
F23['F2.3.11'] = F23['F3.11'] / F23['F2.1']
F23['F2.3.12'] = F23['F3.12'] / F23['F2.1']
F23['F2.3.13'] = F23['F3.1'] / F23['F2.3']
F23['F2.3.14'] = F23['F3.2'] / F23['F2.3']
F23['F2.3.15'] = F23['F3.3'] / F23['F2.3']
F23['F2.3.16'] = F23['F3.4'] / F23['F2.3']
F23['F2.3.17'] = F23['F3.5'] / F23['F2.3']
F23['F2.3.18'] = F23['F3.6'] / F23['F2.3']
F23['F2.3.19'] = F23['F3.7'] / F23['F2.3']
F23['F2.3.20'] = F23['F3.8'] / F23['F2.3']
F23['F2.3.21'] = F23['F3.9'] / F23['F2.3']
F23['F2.3.22'] = F23['F3.10'] / F23['F2.3']
F23['F2.3.23'] = F23['F3.11'] / F23['F2.3']
F23['F2.3.24'] = F23['F3.12'] / F23['F2.3']
F23 = F23[['ID', 'F2.3.1', 'F2.3.2', 'F2.3.3', 'F2.3.4', 'F2.3.5', 'F2.3.6', 'F2.3.7', 'F2.3.8', 'F2.3.9', 'F2.3.10',
           'F2.3.11', 'F2.3.12', 'F2.3.13', 'F2.3.14', 'F2.3.15', 'F2.3.16', 'F2.3.17', 'F2.3.18', 'F2.3.19', 'F2.3.20',
           'F2.3.21', 'F2.3.22', 'F2.3.23', 'F2.3.24']]
#把空值替换为0
F23 = F23.fillna(0)
#把无穷大和无穷小替换为空
F23 = F23.replace([np.inf, -np.inf], np.nan)
F23 = F23.fillna('NA')
F23.to_csv('workeddata/F2.3.csv', index=False, encoding="utf_8_sig")
#print(F23)